Modules/Shop/Http/Controllers/BundleController.php

    public function edit($id)
    {
        $bundle = ShopBundle::with('products')->findOrFail($id);
---
select * from `shop_bundles` where `shop_bundles`.`id` = '4' and `shop_bundles`.`deleted_at` is null limit 1
select `shop_products`.*, `shop_bundle_products`.`bundle_id` as `pivot_bundle_id`, `shop_bundle_products`.`product_id` as `pivot_product_id`, `shop_bundle_products`.`created_at` as `pivot_created_at`, `shop_bundle_products`.`updated_at` as `pivot_updated_at` from `shop_products` inner join `shop_bundle_products` on `shop_products`.`id` = `shop_bundle_products`.`product_id` where `shop_bundle_products`.`bundle_id` in (4) and `shop_products`.`deleted_at` is null

    public function store(Request $request)
    {
        $validator = $this->makeValidator($request);
        if ($validator->fails()) {
            return response()->json([
                'status' => 400,
                'message' => $validator->errors()->first(),
            ], 422);
        }

        $totals = $this->calculateTotals($request);

        $bundle = new ShopBundle();
        $this->fillBundle($bundle, $request, $totals);
        $bundle->save();
        $this->syncFeaturedFlag($bundle);
        $bundle->products()->sync($request->input('product_ids', []));
---
insert into `shop_bundles` (`name`, `short_description`, `component_1`, `component_2`, `component_3`, `component_4`, `price`, `tax_percent`, `discount_type`, `discount`, `total_amount`, `total_tax`, `total_discount`, `status`, `updated_at`, `created_at`) values ('The Study Starter Bundle™', '<p><span style=\"color:rgb(74,74,74);\">Everything you need to begin your NCLEX prep with the right tools, strategy, and mindset.</span></p>', 'FL BON Remediation Guide™ ($87 value)', 'The NCLEX Reset Planner™ ($67 value)', 'Content Area Diagnostic Kit™ ($19 value)', 'NCLEX Day-Of Checklist & Calm Kit™ ($9 value)', '182', '9.65', 'percent', '10', 179.6067, 15.8067, 18.2, 1, '2026-09-04 08:36:33', '2026-09-04 08:36:33')
insert into `shop_bundle_products` (`bundle_id`, `created_at`, `product_id`, `updated_at`) values (3, '2026-09-04 08:36:33', 4, '2026-09-04 08:36:33')

    private function selectableProducts()
    {
        return ShopProduct::query()
            ->whereIn('type', [1, 2, 3, 4])
            ->where('status', '1')
            ->orderBy('type')
            ->orderBy('title')
            ->get(['id', 'title', 'type']);
---
select `id`, `title`, `type` from `shop_products` where `type` in (1, 2, 3, 4) and `status` = '1' and `shop_products`.`deleted_at` is null order by `type` asc, `title` asc