Modules/Shop/Http/Controllers/ProductController.php

select * from `shop_products` where `shop_products`.`id` = '31' and `shop_products`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        $product = ShopProduct::find($id);