app/User.php

select `id` from `programs` where `allcourses` like '%\"1453\"%' or `allcourses` like '%\"1468\"%' or `allcourses` like '%\"1472\"%' or `allcourses` like '%\"1479\"%' or `allcourses` like '%\"1581\"%' or `allcourses` like '%\"1586\"%' or `allcourses` like '%\"1588\"%' or `allcourses` like '%\"1590\"%' or `allcourses` like '%\"1591\"%' or `allcourses` like '%\"1593\"%' or `allcourses` like '%\"1594\"%' or `allcourses` like '%\"1595\"%' or `allcourses` like '%\"1596\"%' or `allcourses` like '%\"1597\"%' or `allcourses` like '%\"1598\"%' or `allcourses` like '%\"1599\"%' or `allcourses` like '%\"1600\"%' or `allcourses` like '%\"1601\"%' or `allcourses` like '%\"1602\"%' or `allcourses` like '%\"1603\"%' or `allcourses` like '%\"1605\"%' or `allcourses` like '%\"1606\"%' or `allcourses` like '%\"1617\"%' or `allcourses` like '%\"1619\"%' or `allcourses` like '%\"1622\"%' or `allcourses` like '%\"1623\"%' or `allcourses` like '%\"1624\"%' or `allcourses` like '%\"1625\"%' or `allcourses` like '%\"1626\"%' or `allcourses` like '%\"1627\"%' or `allcourses` like '%\"1628\"%'
---
    public function totalEnrolled()
    {
        $totalEnrolled = 0;
        $user = $this;
        if ($user->role_id == 2) {
            $courses = Course::where('user_id', $user->id)->pluck('id');
            $program_ids = [];
            if (count($courses)) {
                $programs = Program::query();
                foreach ($courses as $course) {
                    $programs = $programs->orWhere('allcourses', 'like', '%"' . $course . '"%');
                }
                $programs = $programs->pluck('id');