app/View/Components/Breadcrumb.php

select * from `sliders` where exists (select * from `front_pages` where `sliders`.`page_id` = `front_pages`.`id` and (`slug` = 'shop' or `slug` = '/shop') and `front_pages`.`lms_id` = 1) and `status` = 1 and `sliders`.`lms_id` = 1 limit 1
---
    public function render()
    {
        $route = Route::currentRouteName();
        $slider_info = Slider::whereHas('page',function($q){
            $url = request()->path();
            $q->where('slug',$url)
            ->orWhere('slug','/'.$url);
        })
        ->where('status',1)
        ->first();