app/View/Components/CourseDeatilsPageSection.php

    public function render()
    {
        // $duration = $this->duration;
        $courseType = $this->request->get('courseType') ?? 0;
        $related = Course::where('category_id', $this->course->category_id)->with('activeReviews', 'enrollUsers', 'cartUsers', 'lessons')
            ->where('id', '!=', $this->course->id)->with('lessons')->take(2)->get();

        $userRating = userRating($this->course->user_id);
        $courseRating = courseRating($this->course->id,$this->request->get('courseType'));
        $course_exercises = DB::table('course_exercises')
            ->select('file', 'fileName', 'lock')->where('course_id', $this->course->id)->get();
        $course_reviews = DB::table('course_reveiws')->select('user_id')->where('course_id', $this->course->id)->where('courseType',$courseType)->get();
        $course_enrolls = DB::table('course_enrolleds')->select('user_id')->where('course_id', $this->course->id)->get();

        $bookmarked = BookmarkCourse::where('user_id', Auth::id())->where('course_id', $this->course->id)->count();
---
select `users`.*, `course_enrolleds`.`course_id` as `pivot_course_id`, `course_enrolleds`.`user_id` as `pivot_user_id` from `users` inner join `course_enrolleds` on `users`.`id` = `course_enrolleds`.`user_id` where `course_enrolleds`.`course_id` in (1455, 1456)
select `file`, `fileName`, `lock` from `course_exercises` where `course_id` = 1453
select `user_id` from `course_reveiws` where `course_id` = 1453
select `user_id` from `course_enrolleds` where `course_id` = 1453
select count(*) as aggregate from `bookmark_courses` where `user_id` = 855 and `course_id` = 1453

          }
        })->where('scope', 1)->get();
        $courseCategoryId = $this->course->category_id ?? 0;
        $time_tables = TimeTableList::where('time_table_id', $this->course->time_table_id)->groupBy('week')->orderBy('week')->get();
---
select * from `time_table_lists` where `time_table_id` is null group by `week` order by `week` asc