app/View/Components/FooterSectionFourWidget.php

select * from `footer_widgets` where `status` = 1 and `section` = '4' and `footer_widgets`.`lms_id` = 1 order by `pos` desc
---
    public function render()
    {

        $sectionWidget = FooterWidget::where('status', 1)->where('section', '4')
        ->with('frontpage')->orderBy('pos','DESC')
        ->get();