app/Helpers/Helper.php

    function totalUnreadMessages()
    {
        return \Modules\SystemSetting\Entities\Message::where('seen', '=', 0)->where('reciever_id', '=', Auth::id())->count();
---
select count(*) as aggregate from `messages` where `seen` = 0 and `reciever_id` = 1

    function getLanguageList()
    {
        if (isModuleActive('LmsSaas')) {
            $domain = SaasDomain();
        } else {
            $domain = 'main';
        }
        return Cache::rememberForever('LanguageList_' . $domain, function () {
            return DB::table('languages')
                ->where('status', 1)
                ->select('code', 'name', 'native')
                ->where('lms_id', SaasInstitute()->id)
                ->get();
        });
---
select `code`, `name`, `native` from `languages` where `status` = 1 and `lms_id` = 1

    function userRating($user_id)
    {
        $totalRatings['rating'] = 0;
        $ReviewList = DB::table('courses')
            ->join('course_reveiws', 'course_reveiws.course_id', 'courses.id')
            ->select('courses.id', 'course_reveiws.id as review_id', 'course_reveiws.star as review_star')
            ->where('courses.user_id', $user_id)
            ->get();
---
select `courses`.`id`, `course_reveiws`.`id` as `review_id`, `course_reveiws`.`star` as `review_star` from `courses` inner join `course_reveiws` on `course_reveiws`.`course_id` = `courses`.`id` where `courses`.`user_id` = 848

    function courseRating($course_id,$type = null)
    {
        $getparent = DB::table('courses')->where('id',$course_id)->value('parent_id');
        if($getparent != null){
            $course_id == $getparent;
        }
        $totalRatings['rating'] = 0;
        $ReviewList = \Modules\CourseSetting\Entities\CourseReveiw::where('course_id', $course_id)->where('courseType',$type)
            ->get();
---
select `parent_id` from `courses` where `id` = 1453 limit 1
select * from `course_reveiws` where `course_id` = 1453 and `courseType` = '5'

    function GettingError($message, $url = '', $ip = '', $agent = '', $return = false)
    {
        if (Auth::check()) {
            $user_id = Auth::user()->id;
        } else {
            $user_id = 0;
        }
        ErrorLog::create([
            'subject' => $message,
            'type' => '1',
            'url' => $url,
            'ip' => $ip,
            'agent' => $agent,
            'user_id' => $user_id,
        ]);
---
insert into `error_logs` (`subject`, `type`, `url`, `ip`, `agent`, `user_id`, `lms_id`, `updated_at`, `created_at`) values ('Attempt to read property \"id\" on int', '1', 'https://merkaiixcelprep.com/continue-course/musculoskeletal-problems-course-for-the-nursing-students', '119.73.100.12', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/129.0.0.0 Safari/537.36', 855, 1, '2024-10-12 05:54:49', '2024-10-12 05:54:49')

    function footerSettings($key)
    {
        $footerSetting = Cache::rememberForever('footerSetting_' . app()->getLocale() . SaasDomain(), function () {
            return FooterSetting::all();
        });
---
select * from `footer_settings`

    function generateBreadcrumb($currentRoute = null)
    {
        try {
            if (empty($currentRoute)) {
                $currentRoute = Route::currentRouteName();
            }
            $menu = Permission::where('route', $currentRoute)->first();
---
select * from `permissions` where `route` = 'bundle.create' limit 1