app/Http/Controllers/Frontend/CourseController.php

select `users`.*, `course_enrolleds`.`course_id` as `pivot_course_id`, `course_enrolleds`.`user_id` as `pivot_user_id` from `users` inner join `course_enrolleds` on `users`.`id` = `course_enrolleds`.`user_id` where `course_enrolleds`.`course_id` in (1453)
select * from `payment_plans` where `parent_id` in (1455) and `id` <> 0 and `sdate` > '2024-10-12' and `status` = 1 and `payment_plans`.`lms_id` = 1 order by `sdate` asc limit 1
---
    public function courseDetails($slug, Request $request)
    {
        try {
            // dd('test');
            $course = Course::with('enrollUsers', 'user', 'user.courses', 'user.courses.enrollUsers', 'user.courses.lessons', 'chapters.lessons', 'enrolls', 'lessons', 'reviews', 'chapters', 'activeReviews', 'children')
                ->where('slug', $slug)->first();

            if(!$course){
                abort(404);
            }

            $reqCourseType = $request->get('courseType') ?? 0;
            $childIds = Course::where('parent_id', $course['id'])->where('type',$reqCourseType)->get();

            $idArray = [];
            foreach ($childIds as $id) {
                //dd($id["id"]);
                $idArray[] = $id["id"];
            }
            $planCourseType = $reqCourseType == 6 ? 'prep_course_live' : 'full_course';
            $plan = PaymentPlans::where('parent_id', $course['id'])->get();
            $coursePlan = count($childIds) > 0 ? $childIds[0]->effectiveCoursePlan()
            ->first() : null;
            $cpID = $coursePlan->id ?? 0;
            // $futurePlan = $childIds[0]->effectiveCoursePlan[]
            $futurePlan = PaymentPlans:: whereIn('parent_id', $idArray)->where('id','<>',$cpID)
            ->where('sdate','>',date('Y-m-d'))->where('status',1)
            ->orderBy('sdate','ASC')
            ->first();

select count(*) as aggregate from `course_enrolleds` where `course_id` = 1453 and `course_type` = '5' and `user_id` = 855 and (`course_type` not in (4, 6) or (`course_type` in (4, 6) and exists (select * from `payment_plans` where `course_enrolleds`.`plan_id` = `payment_plans`.`id` and ((`sdate` <= '2024-10-12 05:24:43' and `edate` >= '2024-10-12 05:24:43') or `sdate` > '2024-10-12 05:24:43') and `payment_plans`.`lms_id` = 1))) and `course_enrolleds`.`lms_id` = 1
---
                    // ->orWhere('sdate','>',now());
                })->first();
            } else if ($request->has('courseType')) {
                $isEnrolled = CourseEnrolled::where('course_id', $course->id)->where('course_type', $request->courseType)->where('user_id', Auth::id())
                ->where(function($q){
                    $q->whereNotIn('course_type',[4,6])
                    ->orWhere(function($q){
                        $q->whereIn('course_type',[4,6])
                        ->whereHas('plan',function($q){
                            $q->where(function($q){
                            $q->where('sdate','<=',now())
                            ->where('edate','>=',now());
                            })
                            ->orWhere('sdate','>',now());
                        });
                    });
                })
                ->count();

select count(*) as aggregate from `course_reveiws` inner join `users` on `users`.`id` = `course_reveiws`.`user_id` where `course_reveiws`.`course_id` = 1607 and `course_reveiws`.`courseType` = '4'
---
                if ($request->type == "review") {
                    $cType = $request->has('courseType') ? $request->get('courseType') : null;
                    //$review_course_id = (count($course->children) && $request->has('courseType')) ? $course->children->where('type',$request->get('courseType'))->value('id') : $course->id;
                    $reviews = DB::table('course_reveiws')
                        ->select(
                            'course_reveiws.id',
                            'course_reveiws.star',
                            'course_reveiws.comment',
                            'course_reveiws.instructor_id',
                            'course_reveiws.created_at',
                            'users.id as userId',
                            'users.name as userName',
                        )
                        ->join('users', 'users.id', '=', 'course_reveiws.user_id')
                        ->where('course_reveiws.course_id', $course->id)
                        ->where('course_reveiws.courseType', $cType)->paginate(10);

update `courses` set `view` = 472, `courses`.`updated_at` = '2024-10-12 05:24:43' where `id` = 1453
---


            $course->view = $course->view + 1;
            $course->save();