app/Http/Controllers/Frontend/FrontendHomeController.php

            //     })->orWhere('featured',1);
            // })
            ->with('parent','effectiveCoursePlan')->latest()->take(7)->get();
            $allPrograms = Program::where('status',1)->latest()->get();
---
select * from `programs` where `status` = 1 order by `created_at` desc

            //dd($latest_courses);
            $latest_blogs = Blog::where('status', 1)->with('user')->latest()->limit(10)->get();
            $featured_blogs = Blog::where('status',1)->where('featured',1)->with('user')->latest()->limit(3)->get();
            $latest_course_reveiws = CourseReveiw::where('status', 1)->with('user')->latest()->limit(4)->get();
---
select * from `course_reveiws` where `status` = 1 order by `created_at` desc limit 4
select * from `users` where `users`.`id` in (1)

    private function getCourseComparisons()
    {
        $currentDate = date('Y-m-d');
        $comparisons = CourseComparison::with(['course.category', 'course.user', 'program'])
            ->orderBy('course_id')
            ->orderBy('id')
            ->get();
---
select * from `course_comparisons` order by `course_id` asc, `id` asc
select * from `programs` where `programs`.`id` in (11, 12)
select * from `users` where `users`.`id` in (9740)