app/Http/Controllers/Frontend/InstructorController.php

    public function tutorDetails($id, $name, Request $request)
    {
        try {

            $tutor = User::with('tutorReviews', 'userTutorReviews')->findOrFail($id);
            $courses = Course::where('user_id', $id)->where('status', 1)->where('type', 1)->get();

            //            reviews
            if ($request->ajax()) {
                if ($request->type == "review") {
                    $reviews = DB::table('tutor_reveiws')
                        ->select(
                            'tutor_reveiws.id',
                            'tutor_reveiws.star',
                            'tutor_reveiws.comment',
                            'tutor_reveiws.instructor_id',
                            'tutor_reveiws.created_at',
                            'users.id as userId',
                            'users.name as userName',
                        )
                        ->join('users', 'users.id', '=', 'tutor_reveiws.user_id')
                        ->where('tutor_reveiws.instructor_id', $tutor->id)->paginate(10);
---
select * from `users` where `users`.`id` = '856' limit 1
select count(*) as aggregate from `tutor_reveiws` inner join `users` on `users`.`id` = `tutor_reveiws`.`user_id` where `tutor_reveiws`.`instructor_id` = 856