app/Http/Controllers/Frontend/ShopController.php

    public function index(Request $request)
    {
        try {

            $products = ShopProduct::where('status', '1')->get();
---
select * from `shop_products` where `status` = '1' and `shop_products`.`deleted_at` is null

    public function productDetail(Request $request, $id)
    {
        try {

            $product = ShopProduct::where('id', $id)->where('status', '1')->first();
---
select * from `shop_products` where `status` = '1' and `id` != '28' and `shop_products`.`deleted_at` is null order by RAND() limit 3

    public function bookDetail(Request $request, $id)
    {
        try {

            $product = ShopProduct::where('id', $id)->where('status', '1')->first();
---
select * from `shop_products` where `status` = '1' and `id` != '12' and `shop_products`.`deleted_at` is null order by RAND() limit 3

    public function addToCartShop(Request $request, $id)
    {
        try {

            $product = ShopProduct::where('id', $id)->first();
---
select * from `shop_products` where `id` = '32' and `shop_products`.`deleted_at` is null limit 1