app/Http/Controllers/Frontend/WebsiteController.php

    public function fullScreenView(Request $request, $course_id, $lesson_id)
    {
        // dd($request->all());
        try {
            $plan_id = $request->plan_id ?? null;
            $check_lesson = Lesson::where('id', $lesson_id)->with('online_test')->first();
---
select * from `lessons` where `id` = '328' limit 1

            }
            $course = Course::findOrFail($course_id);
            $course->type = $request->courseType;
            $lesson = Lesson::where('id', $lesson_id)->first();
---
select * from `lessons` where `id` = '328' limit 1

            //     $all->where('program_id', $request->program_id);
            // }
            $all = Lesson::where('course_id', $course->id)->with('completed', 'programCompleted');
            $all = $all->orderBy('position', 'asc')->get();;
---
select * from `lessons` where `course_id` = 1586 order by `position` asc

            //     $percentage = 0;
            // }

            $course_reviews = DB::table('course_reveiws')->select('user_id')->where('course_id', $course->id)->get();
---
select `user_id` from `course_reveiws` where `course_id` = 1586

            foreach ($course_reviews as $key => $review) {
                $reviewer_user_ids[] = $review->user_id;
            }
            $chapters = Chapter::where('course_id', $course->id)->orderBy('position', 'asc')->get();
---
select * from `chapters` where `course_id` = 1586 order by `position` asc

                $newsletterSetting = NewsletterSetting::getData();
                if ($newsletterSetting->home_service == "Local") {

                    $check = Subscription::where('email', '=', $request->email)->first();
                    $check_user = User::where('email', '=', $request->email)->first();
---
select * from `subscriptions` where `email` = 'jonathan.e.felix@gmail.com' limit 1
select * from `users` where `email` = 'jonathan.e.felix@gmail.com' limit 1