app/Providers/AppServiceProvider.php

                });
            }

            View::composer(['backend.partials.sidebar'], function ($view) {

                $check = Permission::whereColumn('route', 'parent_route')->get();
                if (count($check) > 0) {
                    foreach ($check as $c) {
                        $c->parent_route = null;
                        $c->save();
                    }
                }
                if (Schema::hasTable('permission_sections')) {
                    $query = PermissionSection::query();
                    if (!showEcommerce()) {
                        $query->where('ecommerce', '!=', 1);
                    }
                    $data['sections'] = $query->with('permissions')->orderBy('position')->get();
                } else {
                    $data['sections'] = [];
                }
                $view->with($data);
            });
---
select * from `permission_sections` order by `position` asc
select * from `permissions` where `route` = `parent_route`

                });


                $data['languages'] = Cache::rememberForever('languages_' . app()->getLocale() . $domain, function () {
                    if (isModuleActive('LmsSaasMD')) {
                        return DB::connection('mysql')->table('languages')->select('id', 'name', 'code', 'rtl', 'status', 'native')
                            ->where('status', 1)
                            ->get();
                    } else {
                        return DB::table('languages')->select('id', 'name', 'code', 'rtl', 'status', 'native')
                            ->where('status', 1)
                            ->where('lms_id', SaasInstitute()->id)
                            ->get();
                    }
                });
---
select `id`, `name`, `code`, `rtl`, `status`, `native` from `languages` where `status` = 1 and `lms_id` = 1


                $view->with($data);
            });
            View::composer([
                'frontend.*',
                'frontend.infixlmstheme.components.breadcrumb'
            ], function ($view) {
                $data['frontendContent'] = $data['homeContent'] = (object)$this->homeContents();
                $data['about_page'] = AboutPage::first();
                $data['become_instructor'] = BecomeInstructor::all();
                $data['work_progress'] = WorkProcess::select('title', 'description')->where('status', 1)->get();
                $view->with($data);
            });
---
select `title`, `description` from `work_processes` where `status` = 1 and `work_processes`.`lms_id` = 1
select * from `become_instructors` where `become_instructors`.`lms_id` = 1
select * from `about_pages` where `about_pages`.`lms_id` = 1 limit 1